EDT/ZUP/zup_edt/src/Documents/НачальныеРасчетыСБюджетомПоНДФЛ/НачальныеРасчетыСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачальныеРасчетыСБюджетомПоНДФЛ</name>
  <comment>АПК:93 Представления объекта и списка совпадают с синонимом</comment>
  <registerRecords>AccumulationRegister.РасчетыСБюджетомПоНДФЛ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетыПоПолучателям</name>
    <attributes>
      <name>РегистрацияВНалоговомОргане</name>
      <type>
        <types>CatalogRef.РегистрацииВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПоСтатьям</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяФинансирования</name>
      <type>
        <types>CatalogRef.СтатьиФинансированияЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиРасходовЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/НачальныеРасчетыСБюджетомПоНДФЛ/Forms/РедактированиеРаспределения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РегистрацияВНалоговомОргане", 	РегистрацияВНалоговомОргане);
	Параметры.Свойство("РаспределяемаяСумма", 			РаспределяемаяСумма);
	Параметры.Свойство("ПроверяемыеПоляРаспределения", 	ПроверяемыеПоляРаспределения);
	
	Если Параметры.РаспределениеПоСтатьям <> Неопределено Тогда
		Для каждого СтрокаРаспределения Из Параметры.РаспределениеПоСтатьям Цикл
			ЗаполнитьЗначенияСвойств(РаспределениеПоСтатьям.Добавить(), СтрокаРаспределения);
		КонецЦикла;
	КонецЕсли;
	
	ИтогРаспределения = РаспределениеПоСтатьям.Итог("Результат");

КонецПроцедуры


&НаКлиенте
Процедура РаспределениеПоСтатьямПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИтогРаспределения = РаспределениеПоСтатьям.Итог("Результат");

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ОК(Команда)
	
	ЗавершитьРедактирование();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершитьРедактирование()
	
	Отказ = Ложь;
	
	Если Модифицированность Тогда
		
		Если Не ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		Иначе
			РезультатРаспределения = РезультатРаспределения();
			Модифицированность = Ложь;
		КонецЕсли;
		
	Иначе
		РезультатРаспределения = Неопределено;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Закрыть(РезультатРаспределения);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция РезультатРаспределения()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеРаспределения   = РаспределениеПоСтатьям.Выгрузить();
	ОтражениеЗарплатыВБухучетеРасширенный.ДополнитьТаблицуРаспределенияКодомСтатьиФинансирования(ДанныеРаспределения);
	
	Описание = Новый Структура;
	Описание.Вставить("РаспределениеПоСтатьям", ЗарплатаКадрыРасширенный.ТаблицаЗначенийВСтруктуру(ДанныеРаспределения));
	
	Возврат Описание;

КонецФункции

&НаСервере
Функция ОписанияПроверяемыхКолонок()
	
	ОписаниеКолонок = Новый Соответствие;
	
	РеквизитыТаблицы = ПолучитьРеквизиты("РаспределениеПоСтатьям");
	Для каждого РеквизитТаблицы Из РеквизитыТаблицы Цикл
		ОписаниеКолонок.Вставить(РеквизитТаблицы.Имя, РеквизитТаблицы.Заголовок); 
	КонецЦикла;
	
	Возврат ОписаниеКолонок;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ОписаниеКолонок = ОписанияПроверяемыхКолонок();
	
	НомерСтроки = 0;
	Для каждого СтрокаРаспределения Из РаспределениеПоСтатьям Цикл
		
		Для Каждого КлючИЗначение Из ПроверяемыеПоляРаспределения Цикл
			
			Если КлючИЗначение.Значение И Не ЗначениеЗаполнено(СтрокаРаспределения[КлючИЗначение.Ключ]) Тогда
				
				ЗаголовокКолонки = ОписаниеКолонок[КлючИЗначение.Ключ];
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Поле ""%1"" не заполнено'"),
					ЗаголовокКолонки);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					,
					"РаспределениеПоСтатьям[" + НомерСтроки + "]." + ОписаниеКолонок[КлючИЗначение.Ключ],
					,
					Отказ);
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЦикла;

	НомерСтроки = ?(НомерСтроки = 0,0,НомерСтроки-1);
	
	Если ИтогРаспределения <> РаспределяемаяСумма Тогда
		
		ТекстСообщения = НСтр("ru='Сумма распределения по статям не равна сумме расчетов с бюджетом.'");
			ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			,
			"РаспределениеПоСтатьям[" + НомерСтроки + "].Результат",
			,
			Отказ);
			
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
